// Задача 64: Задайте значение N. Напишите программу, 
// которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

// Подзадачи:
// 1. Задать N
// 2. Высчитать результат (через рекурсию)
string PrintNumbers(int num)
{
  if (num == 1) return "1";
  else return num + ", " + PrintNumbers(num-1);
}
// 3. Вывести результат

// Решение:
int n = 10;
Console.WriteLine($"Numbers from {n} to 1: {PrintNumbers(n)}.");